package com.xjd.ct.utl.respcode;

/**
 * <pre>
 * 返回码
 * 0000       	成功
 * 0001 ~ 0100	基础公用
 * 0101 ~ 0200	用户相关
 * 0201 ~ 0300	业务对象
 * 0301 ~ 0400	XXXXXXXXXX
 * 0401 ~ 0500	XXXXXXXXXX
 * 9901 ~ 9999	系统错误
 * </pre>
 * 
 * @author elvis.xu
 * @since 2014-12-18
 */
public interface RespCode {

	/** 成功 */
	String RESP_0000 = "0000";

	// ==== 0001 ~ 0100 基础公用 ==== //
	/** 参数({0})不能为空 */
	String RESP_0001 = "0001";
	/** 参数({0})格式错误: {1} */
	String RESP_0002 = "0002";
	/** 参数({0})必须为有效的枚举值 : {1} */
	String RESP_0003 = "0003";
	/** 参数({0})必须在规定的取值范围 : {1} */
	String RESP_0004 = "0004";

	/** 请求必须签名 */
	String RESP_0010 = "0010";
	/** 请求签名有误 */
	String RESP_0011 = "0011";

	// ==== 0101 ~ 0200 用户相关 ==== //
	/** 无效的TOKEN */
	String RESP_0101 = "0101";
	/** 用户不存在 */
	String RESP_0110 = "0110";
	/** 您尚未登录 */
	String RESP_0111 = "0111";
	/** 账号或密码输入错误 */
	String RESP_0112 = "0112";
	/** 密码输入错误 */
	String RESP_0113 = "0113";
	/** 怅号被锁定, 请联系管理员 */
	String RESP_0114 = "0114";
	/** 怅号未被激活, 请先激活账号 */
	String RESP_0115 = "0115";
	/** 您没有操作权限 */
	String RESP_0116 = "0116";
	/** 用户名请填写手机或邮箱 */
	String RESP_0120 = "0120";
	/** 该手机已注册 */
	String RESP_0121 = "0121";
	/** 该邮箱已注册 */
	String RESP_0122 = "0122";
	/** 您已关注了该用户 */
	String RESP_0130 = "0130";
	/** 您尚未关注该用户 */
	String RESP_0131 = "0131";
	/** 不能关注自己 */
	String RESP_0132 = "0132";

	// ==== 201 ~ 0300 业务对象 ==== //

	/** 您访问的业务对象已过期，请刷新页面 */
	String RESP_0201 = "0201";
	/** 您已赞过了 */
	String RESP_0202 = "0202";
	/** 不支持点赞 */
	String RESP_0203 = "0203";
	/** 不支持鄙视 */
	String RESP_0204 = "0204";
	/** 您尚未点赞 */
	String RESP_0205 = "0205";
	/** 您要取消的点赞/鄙视参数有误 */
	String RESP_0206 = "0206";
	/** 您已收藏过了 */
	String RESP_0207 = "0207";
	/** 该对象不支持收藏 */
	String RESP_0208 = "0208";
	/** 您尚未收藏 */
	String RESP_0209 = "0209";
	/** 该对象不支持评论 */
	String RESP_0210 = "0210";
	/** 目标评论不存在, 请刷新 */
	String RESP_0211 = "0211";
	/** 要回复的评论不属于您要评论的对象 */
	String RESP_0212 = "0212";
	/** 该评论不属于您 */
	String RESP_0213 = "0213";
	/** 该订阅专题不存在 */
	String RESP_0214 = "0214";
	/** 该专题已订阅 */
	String RESP_0215 = "0215";
	/** 您尚未订阅该专题 */
	String RESP_0216 = "0216";
	/** 该年龄段不存在 */
	String RESP_0217 = "0217";
	/** 该年龄段已选择 */
	String RESP_0218 = "0218";
	/** 您尚未选择该年龄段 */
	String RESP_0219 = "0219";
	/** 您未上传任何文件 */
	String RESP_0220 = "0220";
	/** 未找到资源 */
	String RESP_0221 = "0221";
	/** 对象不存在或已删除 */
	String RESP_0222 = "0222";
	/** 您无权操作不属于您的对象 */
	String RESP_0223 = "0223";

	// ==== 9901 ~ 9999 系统错误 ==== //

	/** 数据库级错误: 不显示给用户, 作为内部错误, 需要管理员处理 */
	String RESP_9900 = "9900";

	/** 暂无支持该手机系统的应用 */
	String RESP_9970 = "9970";
	/** 未知应用版本 */
	String RESP_9971 = "9971";
	/** 亲，您的应用版本太低了哦，请升级最新版本体验更多功能吧！ */
	String RESP_9972 = "9972";

	/** 无此服务 */
	String RESP_9980 = "9980";
	/** 服务不可用 */
	String RESP_9981 = "9981";
	/** 服务维护中: 显示维护消息 */
	String RESP_9982 = "9982";

	/** 内部错误,请稍后再试或联系管理员 */
	String RESP_9999 = "9999";
}
